{"ts": "2025-11-01T07:46:43.053541Z", "source": "web", "text": "ФИО: Зименков Иван Сергеевич. Дата рождения: 20.05.2004.\nEmail zimenkov04@mail.ru.\nГород проживания: Москва.\nОбразование: Студент 3-го курса бакалавриата кафедры вычислительной техники Института информационных технологий в РТУ МИРЭА. Учусь по направлению «Программная инженерия» по профилю\n«Интеллектуальные системы поддержки принятия решений».\nНавыки:\nЯзыки и технологии:\nPython, Java, C++. В основном использую Python.\nСУБД:\nMySQL, PostgreSQL, SQLite.\nОпыт в построении диаграмм: UML, IDEF, DFD, BPMN, ARIS.\nИностранные языки: Английский – Intermediate.\nТакже, обладаю знаниями в сфере машинного обучения. Имею опыт работы со сверточными, генеративными, графовыми, трансформерными моделями нейросетей. Знаю стандартные алгоритмы оптимизации. Имею хорошие математические навыки, быстро могу понять достаточно сложные алгоритмы. Отлично взаимодействую с нейросетевыми помощниками, например, ChatGPT, интуитивно формулирую правильные и понятные запросы.\nУчастник окружного хакатона от «Цифровой прорыв» в Приволжском федеральном  округе,  было  занято  6  место.  В  кейсе  от  ОАО  «РЖД»\n«Диспетчерский контроль», стояла задача реализовать решение, с применением ИИ, которое позволит распознавать поезда, контролировать занятость/свободность путей и формировать отчеты для диспетчеров. Для распознавания и анализа объектов используется модель Mask R-CNN с\n\nархитектурой ResNet-50, реализованная с помощью фреймворка Detectron2. Мной была проделана работа с отметкой объектов на видео при помощи масок с использованием программы LabelMe. Из результатов могу выделить, что модель успешно классифицировала объекты, определяла риски появления объектов, не относящихся к поездам на путях, определяла время занятости и свободности каждого из представленных путей, а также формировался отчет в формате Excel таблицы.\nВ рамках выполнения курсовой работы за 6-й семестр обучения, реализовал выбранную тему: «Применимость сверточных нейросетей и трансформеров к задачам классификации изображений». Целью работы было, сравнить работоспособность двух моделей в условиях ограниченного объема данных. Для начала я собрал датасет, состоящий из 25705 изображений для обучения и 6820 изображений для тестирования. Для эксперимента реализовал простую сверточную нейросеть и трансформерную модель с архитектурой энкодер-декодер. По полученным результатам обучения двух моделей, были выведены графики, показывающие точность и потерю по каждой эпохе. Обе модели успешно определяли объекты различных типов, которых было всего 7, но также имели и ошибки в предсказаниях, из-за недостаточного обучения, малых гиперпараметрах. Сама курсовая была реализована при помощи библиотеки torch.\nВсе свои модели обучаю на личном ПК, при помощи GPU RTX 3070 Ti с использованием CUDA.\nzimenkov04@mail.ru", "spans": [{"start": 5, "end": 28, "label": "PERSON", "text": "Зименков Иван Сергеевич"}, {"start": 63, "end": 81, "label": "EMAIL_ADDRESS", "text": "zimenkov04@mail.ru"}, {"start": 82, "end": 107, "label": "ADDRESS", "text": "\nГород проживания: Москва"}, {"start": 185, "end": 220, "label": "ORG", "text": "Института информационных технологий"}, {"start": 231, "end": 239, "label": "PERSON", "text": "А. Учусь"}, {"start": 507, "end": 521, "label": "PERSON", "text": "S.\nИностранные"}, {"start": 1004, "end": 1060, "label": "ADDRESS", "text": "Приволжском федеральном  округе,  было  занято  6  место"}, {"start": 2749, "end": 2767, "label": "EMAIL_ADDRESS", "text": "zimenkov04@mail.ru"}]}
